safariextensions/linkpreview/LinkPreviewBackEnd/app/controllers/link_previews_controller.rb

  def image_for_url
    if(params[:url])
        @link_preview = LinkPreview.find_or_create_by_url(params[:url])
---
INSERT INTO "link_previews" ("created_at", "image_file", "updated_at", "url") VALUES('2010-07-02 18:42:46', '/images/LinkPreview/dfac2ac2f8102bbfbd4ef18a247d74cb.pdf', '2010-07-02 18:42:46', 'http://www.youtube.com/')
SELECT * FROM "link_previews" WHERE ("link_previews"."url" = 'http://www.youtube.com/') LIMIT 1

  def index
    @link_previews = LinkPreview.all
---
SELECT * FROM "link_previews"

  def show
    @link_preview = LinkPreview.find(params[:id])
---
SELECT * FROM "link_previews" WHERE ("link_previews"."id" = 1)

  def create
    if(params[:url])
        @link_preview = LinkPreview.find_or_create_by_url(:first, :conditions => {:url => params[:url]})
---
INSERT INTO "link_previews" ("created_at", "image_file", "updated_at", "url") VALUES('2010-07-02 15:51:36', NULL, '2010-07-02 15:51:36', 'www.apple.com')

  def destroy
    @link_preview = LinkPreview.find(params[:id])
    @link_preview.destroy
---
SELECT * FROM "link_previews" WHERE ("link_previews"."id" = 1)
DELETE FROM "link_previews" WHERE "id" = 1